atomvm/AtomVM/src/platforms/stm32/src/lib/spi_driver.c
/*
 * This file is part of AtomVM.
 *
 * Copyright 2026 Paul Guyot <pguyot@kallisys.net>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * SPDX-License-Identifier: Apache-2.0 OR LGPL-2.1-or-later
 */

#include <stdbool.h>
#include <stdlib.h>
#include <string.h>

#include "stm32_hal_platform.h"

#include <context.h>
#include <defaultatoms.h>
#include <erl_nif.h>
#include <erl_nif_priv.h>
#include <globalcontext.h>
#include <memory.h>
#include <nifs.h>
#include <term.h>

// #define ENABLE_TRACE
#include <trace.h>

#include "avm_log.h"
#include "stm_sys.h"

#define TAG "spi_driver"

static ErlNifResourceType *spi_resource_type;

struct SPIResource
{
    SPI_HandleTypeDef handle;
};

static term create_pair(Context *ctx, term term1, term term2)
{
    term ret = term_alloc_tuple(2, &ctx->heap);
    term_put_tuple_element(ret, 0, term1);
    term_put_tuple_element(ret, 1, term2);
    return ret;
}

static bool get_spi_resource(Context *ctx, term resource_term, struct SPIResource **rsrc_obj)
{
    void *rsrc_obj_ptr;
    if (UNLIKELY(!enif_get_resource(erl_nif_env_from_context(ctx), resource_term, spi_resource_type, &rsrc_obj_ptr))) {
        return false;
    }
    struct SPIResource *rsrc = (struct SPIResource *) rsrc_obj_ptr;
    *rsrc_obj = rsrc;
    return true;
}

static bool get_timeout_ms(term timeout_term, uint32_t *out)
{
    if (term_is_atom(timeout_term)) {
        if (timeout_term == INFINITY_ATOM) {
            *out = HAL_MAX_DELAY;
            return true;
        }
        return false;
    }
    if (!term_is_integer(timeout_term)) {
        return false;
    }
    avm_int_t val = term_to_int(timeout_term);
    if (val < 0) {
        return false;
    }
    *out = (uint32_t) val;
    return true;
}

static term hal_status_to_error(Context *ctx, HAL_StatusTypeDef status)
{
    switch (status) {
        case HAL_TIMEOUT:
            return create_pair(ctx, ERROR_ATOM, TIMEOUT_ATOM);
        case HAL_BUSY:
            return create_pair(ctx, ERROR_ATOM, globalcontext_make_atom(ctx->global, ATOM_STR("\x4", "busy")));
        default:
            return create_pair(ctx, ERROR_ATOM, globalcontext_make_atom(ctx->global, ATOM_STR("\x3", "eio")));
    }
}

static SPI_TypeDef *peripheral_to_instance(int peripheral)
{
    switch (peripheral) {
#ifdef SPI1
        case 1:
            return SPI1;
#endif
#ifdef SPI2
        case 2:
            return SPI2;
#endif
#ifdef SPI3
        case 3:
            return SPI3;
#endif
#ifdef SPI4
        case 4:
            return SPI4;
#endif
#ifdef SPI5
        case 5:
            return SPI5;
#endif
#ifdef SPI6
        case 6:
            return SPI6;
#endif
        default:
            return NULL;
    }
}

static void enable_spi_clock(int peripheral)
{
    switch (peripheral) {
#ifdef SPI1
        case 1:
            __HAL_RCC_SPI1_CLK_ENABLE();
            break;
#endif
#ifdef SPI2
        case 2:
            __HAL_RCC_SPI2_CLK_ENABLE();
            break;
#endif
#ifdef SPI3
        case 3:
            __HAL_RCC_SPI3_CLK_ENABLE();
            break;
#endif
#ifdef SPI4
        case 4:
            __HAL_RCC_SPI4_CLK_ENABLE();
            break;
#endif
#ifdef SPI5
        case 5:
            __HAL_RCC_SPI5_CLK_ENABLE();
            break;
#endif
#ifdef SPI6
        case 6:
            __HAL_RCC_SPI6_CLK_ENABLE();
            break;
#endif
        default:
            break;
    }
}

static uint32_t get_spi_apb_freq(const SPI_TypeDef *instance)
{
#if defined(STM32G0XX)
    (void) instance;
    return HAL_RCC_GetPCLK1Freq();
#else
#ifdef SPI2
    if (instance == SPI2) {
        return HAL_RCC_GetPCLK1Freq();
    }
#endif
#ifdef SPI3
    if (instance == SPI3) {
        return HAL_RCC_GetPCLK1Freq();
    }
#endif
    return HAL_RCC_GetPCLK2Freq();
#endif
}

static const uint32_t spi_prescaler_table[] = {
    SPI_BAUDRATEPRESCALER_2,
    SPI_BAUDRATEPRESCALER_4,
    SPI_BAUDRATEPRESCALER_8,
    SPI_BAUDRATEPRESCALER_16,
    SPI_BAUDRATEPRESCALER_32,
    SPI_BAUDRATEPRESCALER_64,
    SPI_BAUDRATEPRESCALER_128,
    SPI_BAUDRATEPRESCALER_256
};

static int compute_spi_prescaler_index(uint32_t apb_freq, uint32_t target_baudrate)
{
    for (int i = 0; i < 8; i++) {
        uint32_t divider = 2U << i;
        if (apb_freq / divider <= target_baudrate) {
            return i;
        }
    }
    return 7;
}

static term nif_spi_init(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    VALIDATE_VALUE(argv[0], term_is_integer);
    VALIDATE_VALUE(argv[1], term_is_map);

    int peripheral = term_to_int(argv[0]);
    term config = argv[1];

    SPI_TypeDef *instance = peripheral_to_instance(peripheral);
    if (IS_NULL_PTR(instance)) {
        AVM_LOGE(TAG, "Invalid SPI peripheral: %d", peripheral);
        RAISE_ERROR(BADARG_ATOM);
    }

    enable_spi_clock(peripheral);

    struct SPIResource *rsrc_obj = enif_alloc_resource(spi_resource_type, sizeof(struct SPIResource));
    if (IS_NULL_PTR(rsrc_obj)) {
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }

    memset(&rsrc_obj->handle, 0, sizeof(SPI_HandleTypeDef));
    rsrc_obj->handle.Instance = instance;

    term mode = term_get_map_assoc_default(config, globalcontext_make_atom(ctx->global, ATOM_STR("\x4", "mode")), term_from_int(0), ctx->global);
    term direction = term_get_map_assoc_default(config, globalcontext_make_atom(ctx->global, ATOM_STR("\x9", "direction")), term_from_int(0), ctx->global);
    term data_size = term_get_map_assoc_default(config, globalcontext_make_atom(ctx->global, ATOM_STR("\x9", "data_size")), term_from_int(0), ctx->global);
    term cpol = term_get_map_assoc_default(config, globalcontext_make_atom(ctx->global, ATOM_STR("\x4", "cpol")), term_from_int(0), ctx->global);
    term cpha = term_get_map_assoc_default(config, globalcontext_make_atom(ctx->global, ATOM_STR("\x4", "cpha")), term_from_int(0), ctx->global);
    term nss = term_get_map_assoc_default(config, globalcontext_make_atom(ctx->global, ATOM_STR("\x3", "nss")), term_from_int(0), ctx->global);
    term baudrate = term_get_map_assoc_default(config, globalcontext_make_atom(ctx->global, ATOM_STR("\x8", "baudrate")), term_from_int(0), ctx->global);
    term first_bit = term_get_map_assoc_default(config, globalcontext_make_atom(ctx->global, ATOM_STR("\x9", "first_bit")), term_from_int(0), ctx->global);
    term ti_mode = term_get_map_assoc_default(config, globalcontext_make_atom(ctx->global, ATOM_STR("\x7", "ti_mode")), term_from_int(0), ctx->global);
    term crc_enable = term_get_map_assoc_default(config, globalcontext_make_atom(ctx->global, ATOM_STR("\xa", "crc_enable")), term_from_int(0), ctx->global);
    term crc_poly = term_get_map_assoc_default(config, globalcontext_make_atom(ctx->global, ATOM_STR("\x8", "crc_poly")), term_from_int(0), ctx->global);
#if !defined(STM32F2XX) && !defined(STM32F4XX)
    term nss_pulse = term_get_map_assoc_default(config, globalcontext_make_atom(ctx->global, ATOM_STR("\x9", "nss_pulse")), term_from_int(0), ctx->global);
    term crc_length = term_get_map_assoc_default(config, globalcontext_make_atom(ctx->global, ATOM_STR("\xa", "crc_length")), term_from_int(0), ctx->global);
#endif

    if (term_to_int(mode) != 0) {
        rsrc_obj->handle.Init.Mode = term_to_int(mode);
    } else {
        rsrc_obj->handle.Init.Mode = SPI_MODE_MASTER;
    }

    if (term_is_integer(direction)) {
        rsrc_obj->handle.Init.Direction = term_to_int(direction);
    } else {
        rsrc_obj->handle.Init.Direction = SPI_DIRECTION_2LINES;
    }

