atomvm/AtomVM/src/platforms/stm32/src/lib/spi_driver.c
    if (term_is_integer(data_size)) {
        rsrc_obj->handle.Init.DataSize = term_to_int(data_size);
    } else {
        rsrc_obj->handle.Init.DataSize = SPI_DATASIZE_8BIT;
    }

    if (term_is_integer(cpol)) {
        rsrc_obj->handle.Init.CLKPolarity = term_to_int(cpol);
    } else {
        rsrc_obj->handle.Init.CLKPolarity = SPI_POLARITY_LOW;
    }

    if (term_is_integer(cpha)) {
        rsrc_obj->handle.Init.CLKPhase = term_to_int(cpha);
    } else {
        rsrc_obj->handle.Init.CLKPhase = SPI_PHASE_1EDGE;
    }

    if (term_is_integer(nss)) {
        rsrc_obj->handle.Init.NSS = term_to_int(nss);
    } else {
        rsrc_obj->handle.Init.NSS = SPI_NSS_SOFT;
    }

    if (term_to_int(baudrate) != 0) {
        uint32_t target_baudrate = (uint32_t) term_to_int(baudrate);
        uint32_t apb_freq = get_spi_apb_freq(instance);
        int presc_idx = compute_spi_prescaler_index(apb_freq, target_baudrate);
        rsrc_obj->handle.Init.BaudRatePrescaler = spi_prescaler_table[presc_idx];
    } else {
        rsrc_obj->handle.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
    }

    if (term_to_int(first_bit) != 0) {
        rsrc_obj->handle.Init.FirstBit = term_to_int(first_bit);
    } else {
        rsrc_obj->handle.Init.FirstBit = SPI_FIRSTBIT_MSB;
    }

    if (term_to_int(ti_mode) != 0) {
        rsrc_obj->handle.Init.TIMode = term_to_int(ti_mode);
    } else {
        rsrc_obj->handle.Init.TIMode = SPI_TIMODE_DISABLE;
    }

    if (term_to_int(crc_enable) != 0) {
        rsrc_obj->handle.Init.CRCCalculation = term_to_int(crc_enable);
    } else {
        rsrc_obj->handle.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
    }

    if (term_to_int(crc_poly) != 0) {
        rsrc_obj->handle.Init.CRCPolynomial = term_to_int(crc_poly);
    } else {
        rsrc_obj->handle.Init.CRCPolynomial = 7;
    }

#if !defined(STM32F2XX) && !defined(STM32F4XX)
    if (term_to_int(nss_pulse) != 0) {
        rsrc_obj->handle.Init.NSSPMode = term_to_int(nss_pulse);
    } else {
        rsrc_obj->handle.Init.NSSPMode = SPI_NSS_PULSE_DISABLE;
    }

    if (term_to_int(crc_length) != 0) {
        rsrc_obj->handle.Init.CRCLength = term_to_int(crc_length);
    } else {
        rsrc_obj->handle.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
    }
#endif

    HAL_StatusTypeDef status = HAL_SPI_Init(&rsrc_obj->handle);
    if (status != HAL_OK) {
        enif_release_resource(rsrc_obj);
        AVM_LOGE(TAG, "HAL_SPI_Init failed: %d", (int) status);
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            RAISE_ERROR(OUT_OF_MEMORY_ATOM);
        }
        return create_pair(ctx, ERROR_ATOM, globalcontext_make_atom(ctx->global, ATOM_STR("\x8", "spi_init")));
    }

    uint32_t actual_baudrate = 0;
    {
        uint32_t apb_freq = get_spi_apb_freq(instance);
        int presc_idx = 0;
        for (int i = 0; i < 8; i++) {
            if (spi_prescaler_table[i] == rsrc_obj->handle.Init.BaudRatePrescaler) {
                presc_idx = i;
                break;
            }
        }
        actual_baudrate = apb_freq / (2U << presc_idx);
    }

    if (UNLIKELY(memory_ensure_free(ctx, TERM_BOXED_RESOURCE_SIZE) != MEMORY_GC_OK)) {
        HAL_SPI_DeInit(&rsrc_obj->handle);
        enif_release_resource(rsrc_obj);
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }
    term obj = term_from_resource(rsrc_obj, &ctx->heap);
    enif_release_resource(rsrc_obj);

    size_t requested_size = TUPLE_SIZE(2) + TUPLE_SIZE(2);
    if (UNLIKELY(memory_ensure_free_with_roots(ctx, requested_size, 1, &obj, MEMORY_CAN_SHRINK) != MEMORY_GC_OK)) {
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }

    term inner = term_alloc_tuple(2, &ctx->heap);
    term_put_tuple_element(inner, 0, term_from_int(actual_baudrate));
    term_put_tuple_element(inner, 1, obj);

    return create_pair(ctx, OK_ATOM, inner);
}

static term nif_spi_apply_device_config(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    struct SPIResource *rsrc_obj;
    if (UNLIKELY(!get_spi_resource(ctx, argv[0], &rsrc_obj))) {
        RAISE_ERROR(BADARG_ATOM);
    }
    if (IS_NULL_PTR(rsrc_obj->handle.Instance)) {
        RAISE_ERROR(BADARG_ATOM);
    }
    VALIDATE_VALUE(argv[1], term_is_map);

    term config = argv[1];
    term clock_speed_hz_term = term_get_map_assoc(config, globalcontext_make_atom(ctx->global, ATOM_STR("\xE", "clock_speed_hz")), ctx->global);
    term mode_term = term_get_map_assoc(config, globalcontext_make_atom(ctx->global, ATOM_STR("\x4", "mode")), ctx->global);

    bool changed = false;

    if (!term_is_invalid_term(clock_speed_hz_term)) {
        if (UNLIKELY(!term_is_integer(clock_speed_hz_term))) {
            RAISE_ERROR(BADARG_ATOM);
        }
        avm_int_t clock_speed_hz = term_to_int(clock_speed_hz_term);
        if (UNLIKELY(clock_speed_hz <= 0)) {
            RAISE_ERROR(BADARG_ATOM);
        }
        uint32_t apb_freq = get_spi_apb_freq(rsrc_obj->handle.Instance);
        int presc_idx = compute_spi_prescaler_index(apb_freq, (uint32_t) clock_speed_hz);
        uint32_t new_prescaler = spi_prescaler_table[presc_idx];
        if (rsrc_obj->handle.Init.BaudRatePrescaler != new_prescaler) {
            rsrc_obj->handle.Init.BaudRatePrescaler = new_prescaler;
            changed = true;
        }
    }

    if (!term_is_invalid_term(mode_term)) {
        if (UNLIKELY(!term_is_integer(mode_term))) {
            RAISE_ERROR(BADARG_ATOM);
        }
        avm_int_t mode = term_to_int(mode_term);
        if (UNLIKELY(mode < 0 || mode > 3)) {
            RAISE_ERROR(BADARG_ATOM);
        }
        uint32_t new_cpol = (mode & 2) ? SPI_POLARITY_HIGH : SPI_POLARITY_LOW;
        uint32_t new_cpha = (mode & 1) ? SPI_PHASE_2EDGE : SPI_PHASE_1EDGE;
        if (rsrc_obj->handle.Init.CLKPolarity != new_cpol
            || rsrc_obj->handle.Init.CLKPhase != new_cpha) {
            rsrc_obj->handle.Init.CLKPolarity = new_cpol;
            rsrc_obj->handle.Init.CLKPhase = new_cpha;
            changed = true;
        }
    }

