atomvm/AtomVM/src/platforms/stm32/src/lib/spi_driver.c
static term nif_spi_get_error(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    struct SPIResource *rsrc_obj;
    if (UNLIKELY(!get_spi_resource(ctx, argv[0], &rsrc_obj))) {
        RAISE_ERROR(BADARG_ATOM);
    }
    if (IS_NULL_PTR(rsrc_obj->handle.Instance)) {
        RAISE_ERROR(BADARG_ATOM);
    }
    uint32_t err = HAL_SPI_GetError(&rsrc_obj->handle);

    return term_from_int((int) err);
}

static void spi_resource_dtor(ErlNifEnv *caller_env, void *obj)
{
    UNUSED(caller_env);
    struct SPIResource *rsrc_obj = (struct SPIResource *) obj;
    if (!IS_NULL_PTR(rsrc_obj->handle.Instance)) {
        HAL_SPI_DeInit(&rsrc_obj->handle);
        rsrc_obj->handle.Instance = NULL;
    }
}

static const ErlNifResourceTypeInit SPIResourceTypeInit = {
    .members = 1,
    .dtor = spi_resource_dtor,
};

//
// NIF structs
//
static const struct Nif spi_init_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_spi_init
};
static const struct Nif spi_apply_device_config_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_spi_apply_device_config
};
static const struct Nif spi_deinit_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_spi_deinit
};
static const struct Nif spi_transmit_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_spi_transmit
};
static const struct Nif spi_receive_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_spi_receive
};
static const struct Nif spi_transmit_receive_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_spi_transmit_receive
};
static const struct Nif spi_abort_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_spi_abort
};
static const struct Nif spi_get_state_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_spi_get_state
};
static const struct Nif spi_get_error_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_spi_get_error
};

static void spi_nif_init(GlobalContext *global)
{
    ErlNifEnv env;
    erl_nif_env_partial_init_from_globalcontext(&env, global);
    spi_resource_type = enif_init_resource_type(&env, "spi_resource", &SPIResourceTypeInit, ERL_NIF_RT_CREATE, NULL);
}

static const struct Nif *spi_nif_get_nif(const char *nifname)
{
    if (strncmp("spi:", nifname, 4) != 0) {
        return NULL;
    }
    const char *rest = nifname + 4;
    if (strcmp("init/2", rest) == 0) {
        TRACE("Resolved spi nif %s ...\n", nifname);
        return &spi_init_nif;
    }
    if (strcmp("apply_device_config/2", rest) == 0) {
        TRACE("Resolved spi nif %s ...\n", nifname);
        return &spi_apply_device_config_nif;
    }
    if (strcmp("deinit/1", rest) == 0) {
        TRACE("Resolved spi nif %s ...\n", nifname);
        return &spi_deinit_nif;
    }
    if (strcmp("transmit/3", rest) == 0) {
        TRACE("Resolved spi nif %s ...\n", nifname);
        return &spi_transmit_nif;
    }
    if (strcmp("receive_/3", rest) == 0) {
        TRACE("Resolved spi nif %s ...\n", nifname);
        return &spi_receive_nif;
    }
    if (strcmp("transmit_receive/3", rest) == 0) {
        TRACE("Resolved spi nif %s ...\n", nifname);
        return &spi_transmit_receive_nif;
    }
    if (strcmp("abort/1", rest) == 0) {
        TRACE("Resolved spi nif %s ...\n", nifname);
        return &spi_abort_nif;
    }
    if (strcmp("get_state/1", rest) == 0) {
        TRACE("Resolved spi nif %s ...\n", nifname);
        return &spi_get_state_nif;
    }
    if (strcmp("get_error/1", rest) == 0) {
        TRACE("Resolved spi nif %s ...\n", nifname);
        return &spi_get_error_nif;
    }
    return NULL;
}

REGISTER_NIF_COLLECTION(spi, spi_nif_init, NULL, spi_nif_get_nif)
